In [10]:
# Dependencies
import pandas as pd

import matplotlib.pyplot as plt
import numpy as np

# Imports the method used for connecting to DBs
from sqlalchemy import create_engine

# Imports the methods needed to abstract classes into tables
from sqlalchemy.ext.declarative import declarative_base

# Allow us to declare column types
from sqlalchemy import Column, Integer, String, Float 

#import credentials
from sql_cred import sql_username
from sql_cred import sql_password

In [11]:
username = sql_username
password = sql_password

connect_string = (f'postgresql://{username}:{password}@localhost:5432/sql-challenge')
engine = create_engine(connect_string)

In [12]:
salary_df = pd.read_sql('SELECT * FROM "Salaries"', engine)
salary_df.head(10)

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006
3   10004   40054
4   10005   78228
5   10006   40000
6   10007   56724
7   10008   46671
8   10009   60929
9   10010   72488

In [ ]:

# emp_salaries = salary_df["salary"]
# emp_salaries.plot(kind = "hist")

employee_df["salary"].plot(kind = "hist")
plot.show()

In [ ]:
employee_df = pd.read_sql('SELECT * FROM "Employees"', engine)
employee_df

In [7]:
recurring_value = employee_df.loc(employee_df.mode([emp_no])
recurring_value

SyntaxError: invalid syntax (<ipython-input-7-027b0a597e80>, line 2)